// 习题2.8 输出全排列
// 分数 20
// 作者 DS课程组
// 单位 浙江大学
// 请编写程序输出前n个正整数的全排列（n<10），并通过9个测试用例（即n从1到9）观察n逐步增大时程序的运行时间。

// 输入格式:
// 输入给出正整数n（<10）。

// 输出格式:
// 输出1到n的全排列。每种排列占一行，数字间无空格。排列的输出顺序为字典序，即序列a 
// 1
// ​
//  ,a 
// 2
// ​
//  ,⋯,a 
// n
// ​
//  排在序列b 
// 1
// ​
//  ,b 
// 2
// ​
//  ,⋯,b 
// n
// ​
//  之前，如果存在k使得a 
// 1
// ​
//  =b 
// 1
// ​
//  ,⋯,a 
// k
// ​
//  =b 
// k
// ​
//   并且 a 
// k+1
// ​
//  <b 
// k+1
// ​
//  。

// 输入样例：
// 3
// 输出样例：
// 123
// 132
// 213
// 231
// 312
// 321

#include<stdio.h>
int num[10] = {};
int arr[10] = {};//bool
int n; 
void bfs(int step){
    if(step == n+1){
        for(int i=1;i<=n;i++) printf("%d",num[i]);
        printf("\n");
        return ;
    }
    for (int i=1;i<=n;i++){
        if(!arr[i]){
            arr[i] = 1;
            num[step] = i;
            bfs(step+1);
            arr[i] = 0;
        }
    }
}

int main(){
    scanf("%d",&n);
    bfs(1);
}